#include<iostream>
using namespace std;
int main(){
    /*
    ### 2.5 转义字符

**作用：**用于表示一些==不能显示出来的ASCII字符==

现阶段我们常用的转义字符有：` \n  \\  \t`

| **转义字符** | **含义**                                | **ASCII**码值（十进制） |
| ------------ | --------------------------------------- | ----------------------- |
| \a           | 警报                                    | 007                     |
| \b           | 退格(BS) ，将当前位置移到前一列         | 008                     |
| \f           | 换页(FF)，将当前位置移到下页开头        | 012                     |
| **\n**       | **换行(LF) ，将当前位置移到下一行开头** | **010**                 |
| \r           | 回车(CR) ，将当前位置移到本行开头       | 013                     |
| **\t**       | **水平制表(HT)  （跳到下一个TAB位置）** | **009**                 |
| \v           | 垂直制表(VT)                            | 011                     |
| **\\\\**     | **代表一个反斜线字符"\"**               | **092**                 |
| \'           | 代表一个单引号（撇号）字符              | 039                     |
| \"           | 代表一个双引号字符                      | 034                     |
| \?           | 代表一个问号                            | 063                     |
| \0           | 数字0                                   | 000                     |
| \ddd         | 8进制转义字符，d范围0~7                 | 3位8进制                |
| \xhh         | 16进制转义字符，h范围0~9，a~f，A~F      | 3位16进制               |
    **/
    int a = 0666;
    int b = 0xad67;
    int c = 10000;
    cout << "\\" << endl;
    cout << "\tHello World !!" << endl;
    cout << "\n" << endl;
    cout << a << endl;
    cout << b <<endl;
    cout << "a(八进制) ：" << oct << a << endl; //八进制打印
    cout << "c(八进制) ：" << oct << c << endl; //八进制打印
    cout << "c(十六进制) ：" << hex << c << endl; //十六进制打印
    cout << "c(十进制) ： " << dec << c <<endl; //十进制打印
    return 0;
}
